In [84]:
import pandas as pd

# Wczytanie naszych danych, sprawdzenie jak wyglądają.

In [85]:
df = pd.read_csv('data_to_clean.csv')
df.head()

,Rank,Peak,All Time Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Tour title,Shows,Average gross,Ref.,gender
0,1,1,2,"$780,000,000","$780,000,000",Taylor Swift,The Eras Tour †,56,"$13,928,571",[1],Male
1,2,1,NaN,"$579,800,000","$579,800,000",Beyoncé,Renaissance World Tour,56,"$10,353,571",[3],Female
2,3,1[4],NaN,"$411,000,000","$560,622,615",Madonna,Sticky & Sweet Tour ‡[4][a],85,"$4,835,294",[6],Male
3,4,2[7],10[7],"$397,300,000","$454,751,555",Pink,Beautiful Trauma World Tour,156,"$2,546,795",[7],m
4,5,2[4],NaN,"$345,675,146","$402,844,849",Taylor Swift,Reputation Stadium Tour,53,"$6,522,173",[8],F

# Sprawdzamy czy mamy duplikaty

In [86]:
df.duplicated().sum()

np.int64(5)

Usuwamy duplikaty

In [87]:
df.drop_duplicates(inplace=True)

inplace=True oznacza, że aktualizujemy nasze dane.

# Sprawdzamy wielkość naszego Datasetu

In [88]:
df.shape

(20, 11)

# Sprawdzamy czy mamy wartości NaN

In [89]:
df.isna().sum()

Rank                                 0
Peak                                 2
All Time Peak                       18
Actual gross                         0
Adjusted gross (in 2022 dollars)     0
Artist                               0
Tour title                           0
Shows                                0
Average gross                        0
Ref.                                 0
gender                               0
dtype: int64

# Usuwamy kolumnę All Time Peak - ponieważ cała praktycznie to Null

In [90]:
df.drop('All Time Peak', axis=1, inplace=True)

W tym przypadku kolumna "All Time Peak " jest pełna nulli (brak danych), więc nie zawiera żadnych informacji, które mogłyby pomóc w przewidywaniu jakichkolwiek wyników w modelu uczenia maszynowego.  

W ramach feature engineering, możemy usunąć tę kolumnę, ponieważ nie wnosi ona żadnej wartości do modelu.  

Jednak co to **Feature engineering?**  

to proces tworzenia nowych cech (features) z istniejących danych w celu poprawy wydajności modelu uczenia maszynowego. Polega na transformacji, modyfikacji lub usuwaniu danych w taki sposób, aby uczynić je bardziej wartościowymi lub odpowiednimi dla algorytmu modelu

# Usuń w pozostałych kolumnach wiersze zawierające Nulle (dropna)

In [91]:
df.dropna(inplace=True)

**Możemy również inputować dane.** Np. zamienić Nulle na 0/średnią/medianę/najczęściej występującą wartość/'Other'

W tym przypadku tak by to wyglądało: **df['Peak'] = df['Peak'].fillna(0)**

# Sprawdź czy mamy wartości NaN

In [92]:
df.isna().sum()

Rank                                0
Peak                                0
Actual gross                        0
Adjusted gross (in 2022 dollars)    0
Artist                              0
Tour title                          0
Shows                               0
Average gross                       0
Ref.                                0
gender                              0
dtype: int64

W tym momencie wszędzie powinny być 0.

# Czyszczenie kolumn numerycznych

In [93]:
df['Average gross'] = df['Average gross'].str.replace(r'[^0-9.]', '', regex=True).astype(float)

Czyszczenie wartości z kolumny "Average gross", usuwamy znaki nie będące liczbami. Zmieniamy na float.

# Teraz zrób to dla kolumn: Adjusted gross (in 2022 dollars) oraz Actual gross

In [94]:
df['Adjusted gross (in 2022 dollars)'] = df['Adjusted gross (in 2022 dollars)'].str.replace(r'[^0-9.]', '', regex=True).astype(float)
df['Actual gross'] = df['Actual gross'].str.replace(r'[^0-9.]', '', regex=True).astype(float)

# Czyszczenie kolumny Peak, będziemy usuwać []

In [95]:
df['Peak'].value_counts()

Peak
2[10]    5
2[4]     4
1        3
2[7]     3
1[4]     1
1[20]    1
2[c]     1
Name: count, dtype: int64

In [96]:
df['Peak'] = df['Peak'].str.replace(r'[^0-9]', '', regex=True).astype(int)

Usuwamy wszystko co nie jest cyfrą

In [97]:
df['Peak'].value_counts()

Peak
210    5
24     4
1      3
27     3
14     1
120    1
2      1
Name: count, dtype: int64

# Teraz usuń nawiasy w kolumnie Ref.

In [98]:
df['Ref.'] = df['Ref.'].str.replace(r'[^0-9.]', '', regex=True).astype(float)

In [99]:
df['Ref.']

0        1.0
1        3.0
2        6.0
3        7.0
4        8.0
5        9.0
6       11.0
7       12.0
8       13.0
10    1516.0
11      18.0
12      19.0
13      20.0
14       5.0
15      22.0
16       4.0
18      26.0
19       7.0
Name: Ref., dtype: float64

# Zostało nam zająć się kolumną gender. Jak widać mamy różne dane a wystarczą dwie.

In [100]:
df['gender'].value_counts()

gender
f         5
m         4
Male      3
Female    2
F         2
M         2
Name: count, dtype: int64

# Zamień dane, aby w każdym wierszu było f lub m.

In [101]:
df['gender'] = df['gender'].replace(['Female','F'] , 'f', regex=True)
df['gender'] = df['gender'].replace(['Male','M'] , 'm', regex=True)

# Sprawdź czy wszystko jest okej.

In [102]:
df['gender'].value_counts()

gender
m    9
f    9
Name: count, dtype: int64

# Sprawdź jak wygląda wyczyszczony dataset.

In [103]:
df.head()

,Rank,Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Tour title,Shows,Average gross,Ref.,gender
0,1,1,780000000.0,780000000.0,Taylor Swift,The Eras Tour †,56,13928571.0,1.0,m
1,2,1,579800000.0,579800000.0,Beyoncé,Renaissance World Tour,56,10353571.0,3.0,f
2,3,14,411000000.0,560622615.0,Madonna,Sticky & Sweet Tour ‡[4][a],85,4835294.0,6.0,m
3,4,27,397300000.0,454751555.0,Pink,Beautiful Trauma World Tour,156,2546795.0,7.0,m
4,5,24,345675146.0,402844849.0,Taylor Swift,Reputation Stadium Tour,53,6522173.0,8.0,f

# Dla chętnych

Materiały dotyczące analizy danych.

Czyszczenie danych: https://www.freecodecamp.org/news/data-cleaning-and-preprocessing-with-pandasbdvhj/  

Więcej o Feature Engineering: https://www.geeksforgeeks.org/what-is-feature-engineering/

Kurs DataCamp: https://app.datacamp.com/learn/courses/cleaning-data-in-python

# Gdzie ćwiczyć?

Stroną gdzie możemy pobrać dużo różnych datasetów za darmo jest: https://www.kaggle.com/.   

Jeśli masz ochotę polecam wybrać jakiś dataset i spróbować samemu go wyczyścić.  

Przykładowy dataset z kaggla: https://www.kaggle.com/datasets/ahmedmohamed2003/cafe-sales-dirty-data-for-cleaning-training